controllers/SiteController.php

public function actionUpload(){

    $images = Image::find()
        ->where(['user_id' => $_SESSION['__id']])
        ->all();
---
SELECT * FROM `image` WHERE `user_id`=24