models/User.php

SELECT * FROM `user` WHERE `id`=24
---
    public static function findIdentity($id)
    {
        return static::findOne($id);

SELECT * FROM `user` WHERE `username`='admin'
---
    public static function findByUsername($username)
    {
         return static::findOne(['username' => $username]);